sterentev/atdf-device-asm-include/inc/ATmega128RFR2.inc
; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare for Channel B
.equ	FOC1C		= 5		; 0x20 - Force Output Compare for Channel C

; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

; ----------	Register TIFR1 bits		------------------------
.equ	ICF1		= 5		; 0x20 - Timer/Counter1 Input Capture Flag
.equ	OCF1C		= 3		; 0x08 - Timer/Counter1 Output Compare C Match Flag
.equ	OCF1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Flag
.equ	OCF1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Flag
.equ	TOV1		= 0		; 0x01 - Timer/Counter1 Overflow Flag



; ====	TRX24 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PARCR bits		------------------------
.equ	PALTD_MASK	= 0xE0		;      - ext. PA Ramp Down Lead Time (3 bits)
.equ	PALTD0		= 5		;          PALTD BIT0 position
.equ	PALTU_MASK	= 0x1C		;      - ext. PA Ramp Up Lead Time (3 bits)
.equ	PALTU0		= 2		;          PALTU BIT0 position
.equ	PARDFI		= 1		; 0x02 - Power Amplifier Ramp Down Frequency Inversion
.equ	PARUFI		= 0		; 0x01 - Power Amplifier Ramp Up Frequency Inversion
; ::::  PALTD	:::: bitfield values
;			0x00		; -3us
;			0x20		; -2us
;			0x40		; -1us
;			0x60		; 0us
;			0x80		; 1us
;			0xA0		; 2us
;			0xC0		; 3us
;			0xE0		; 4us
; ::::  PALTU	:::: bitfield values
;			0x00		; -3us
;			0x04		; -2us
;			0x08		; -1us
;			0x0C		; 0us
;			0x10		; 1us
;			0x14		; 2us
;			0x18		; 3us
;			0x1C		; 4us

; ----------	Register MAFSA0L bits		------------------------
.equ	MAFSA0L_MASK	= 0xFF		;      - MAC Short Address low Byte for Frame Filter 0 (8 bits)
.equ	MAFSA0L0	= 0		;          MAFSA0L BIT0 position

; ----------	Register MAFSA0H bits		------------------------
.equ	MAFSA0H_MASK	= 0xFF		;      - MAC Short Address high Byte for Frame Filter 0 (8 bits)
.equ	MAFSA0H0	= 0		;          MAFSA0H BIT0 position

; ----------	Register MAFPA0L bits		------------------------
.equ	MAFPA0L_MASK	= 0xFF		;      - MAC Personal Area Network ID low Byte for Frame Filter 0 (8 bits)
.equ	MAFPA0L0	= 0		;          MAFPA0L BIT0 position

; ----------	Register MAFPA0H bits		------------------------
.equ	MAFPA0H_MASK	= 0xFF		;      - MAC Personal Area Network ID high Byte for Frame Filter 0 (8 bits)
.equ	MAFPA0H0	= 0		;          MAFPA0H BIT0 position

; ----------	Register MAFSA1L bits		------------------------
.equ	MAFSA1L_MASK	= 0xFF		;      - MAC Short Address low Byte for Frame Filter 1 (8 bits)
.equ	MAFSA1L0	= 0		;          MAFSA1L BIT0 position

; ----------	Register MAFSA1H bits		------------------------
.equ	MAFSA1H_MASK	= 0xFF		;      - MAC Short Address high Byte for Frame Filter 1 (8 bits)
.equ	MAFSA1H0	= 0		;          MAFSA1H BIT0 position

; ----------	Register MAFPA1L bits		------------------------
.equ	MAFPA1L_MASK	= 0xFF		;      - MAC Personal Area Network ID low Byte for Frame Filter 1 (8 bits)
.equ	MAFPA1L0	= 0		;          MAFPA1L BIT0 position

; ----------	Register MAFPA1H bits		------------------------
.equ	MAFPA1H_MASK	= 0xFF		;      - MAC Personal Area Network ID high Byte for Frame Filter 1 (8 bits)
.equ	MAFPA1H0	= 0		;          MAFPA1H BIT0 position

; ----------	Register MAFSA2L bits		------------------------
.equ	MAFSA2L_MASK	= 0xFF		;      - MAC Short Address low Byte for Frame Filter 2 (8 bits)
.equ	MAFSA2L0	= 0		;          MAFSA2L BIT0 position

; ----------	Register MAFSA2H bits		------------------------
.equ	MAFSA2H_MASK	= 0xFF		;      - MAC Short Address high Byte for Frame Filter 2 (8 bits)
.equ	MAFSA2H0	= 0		;          MAFSA2H BIT0 position

; ----------	Register MAFPA2L bits		------------------------
.equ	MAFPA2L_MASK	= 0xFF		;      - MAC Personal Area Network ID low Byte for Frame Filter 2 (8 bits)
.equ	MAFPA2L0	= 0		;          MAFPA2L BIT0 position

; ----------	Register MAFPA2H bits		------------------------
.equ	MAFPA2H_MASK	= 0xFF		;      - MAC Personal Area Network ID high Byte for Frame Filter 2 (8 bits)
.equ	MAFPA2H0	= 0		;          MAFPA2H BIT0 position

; ----------	Register MAFSA3L bits		------------------------
.equ	MAFSA3L_MASK	= 0xFF		;      - MAC Short Address low Byte for Frame Filter 3 (8 bits)
.equ	MAFSA3L0	= 0		;          MAFSA3L BIT0 position

; ----------	Register MAFSA3H bits		------------------------
.equ	MAFSA3H_MASK	= 0xFF		;      - MAC Short Address high Byte for Frame Filter 3 (8 bits)
.equ	MAFSA3H0	= 0		;          MAFSA3H BIT0 position

; ----------	Register MAFPA3L bits		------------------------
.equ	MAFPA3L_MASK	= 0xFF		;      - MAC Personal Area Network ID low Byte for Frame Filter 3 (8 bits)
.equ	MAFPA3L0	= 0		;          MAFPA3L BIT0 position

; ----------	Register MAFPA3H bits		------------------------
.equ	MAFPA3H_MASK	= 0xFF		;      - MAC Personal Area Network ID high Byte for Frame Filter 3 (8 bits)
.equ	MAFPA3H0	= 0		;          MAFPA3H BIT0 position

; ----------	Register MAFCR0 bits		------------------------
.equ	MAFCR0_Res_MASK	= 0xF0		;      - Reserved Bit (4 bits)
.equ	MAFCR0_Res0	= 4		;          MAFCR0_Res BIT0 position
.equ	MAF3EN		= 3		; 0x08 - Multiple Address Filter 3 Enable
.equ	MAF2EN		= 2		; 0x04 - Multiple Address Filter 2 Enable
.equ	MAF1EN		= 1		; 0x02 - Multiple Address Filter 1 Enable
.equ	MAF0EN		= 0		; 0x01 - Multiple Address Filter 0 Enable

; ----------	Register MAFCR1 bits		------------------------
.equ	AACK_3_SET_PD	= 7		; 0x80 - Set Data Pending bit for address filter 3.
.equ	AACK_3_I_AM_COORD= 6		; 0x40 - Enable PAN Coordinator mode for address filter 3.
.equ	AACK_2_SET_PD	= 5		; 0x20 - Set Data Pending bit for address filter 2.
.equ	AACK_2_I_AM_COORD= 4		; 0x10 - Enable PAN Coordinator mode for address filter 2.
.equ	AACK_1_SET_PD	= 3		; 0x08 - Set Data Pending bit for address filter 1.
.equ	AACK_1_I_AM_COORD= 2		; 0x04 - Enable PAN Coordinator mode for address filter 1.
.equ	AACK_0_SET_PD	= 1		; 0x02 - Set Data Pending bit for address filter 0.
.equ	AACK_0_I_AM_COORD= 0		; 0x01 - Enable PAN Coordinator mode for address filter 0.

; ----------	Register AES_CTRL bits		------------------------
.equ	AES_REQUEST	= 7		; 0x80 - Request AES Operation.
.equ	AES_MODE	= 5		; 0x20 - Set AES Operation Mode
.equ	AES_DIR		= 3		; 0x08 - Set AES Operation Direction
.equ	AES_IM		= 2		; 0x04 - AES Interrupt Enable
; ::::  AES_MODE	:::: bitfield values
;			0x00		; AES Mode is ECB (Electronic Code Book).
;			0x20		; AES Mode is CBC (Cipher Block Chaining).
; ::::  AES_DIR	:::: bitfield values
;			0x00		; AES operation is encryption.
;			0x08		; AES operation is decryption.

; ----------	Register AES_STATUS bits	------------------------
.equ	AES_ER		= 7		; 0x80 - AES Operation Finished with Error
.equ	AES_DONE	= 0		; 0x01 - AES Operation Finished with Success

; ----------	Register AES_STATE bits		------------------------
.equ	AES_STATE_MASK	= 0xFF		;      - AES Plain and Cipher Text Buffer (8 bits)
.equ	AES_STATE0	= 0		;          AES_STATE BIT0 position

; ----------	Register AES_KEY bits		------------------------
.equ	AES_KEY_MASK	= 0xFF		;      - AES Encryption/Decryption Key Buffer (8 bits)
.equ	AES_KEY0	= 0		;          AES_KEY BIT0 position

; ----------	Register TRX_STATUS bits	------------------------
.equ	CCA_DONE	= 7		; 0x80 - CCA Algorithm Status
.equ	CCA_STATUS	= 6		; 0x40 - CCA Status Result
.equ	TST_STATUS	= 5		; 0x20 - Test mode status
.equ	TRX_STATUS_MASK	= 0x1F		;      - Transceiver Main Status (5 bits)
.equ	TRX_STATUS0	= 0		;          TRX_STATUS BIT0 position
; ::::  CCA_DONE	:::: bitfield values
;			0x00		; CCA calculation not finished
;			0x80		; CCA calculation finished
; ::::  CCA_STATUS	:::: bitfield values
;			0x00		; Channel indicated as busy.
;			0x40		; Channel indicated as idle.
; ::::  TST_STATUS	:::: bitfield values
;			0x00		; Test mode is disabled.
;			0x20		; Test mode is active.
; ::::  TRX_STATUS	:::: bitfield values
;			0x00		; P_ON
;			0x01		; BUSY_RX
;			0x02		; BUSY_TX
;			0x06		; RX_ON
;			0x08		; TRX_OFF
;			0x09		; PLL_ON
;			0x0F		; SLEEP
;			0x11		; BUSY_RX_AACK
;			0x12		; BUSY_TX_ARET
;			0x16		; RX_AACK_ON
;			0x19		; TX_ARET_ON
;			0x1F		; STATE_TRANSITION_IN_PROGRESS

; ----------	Register TRX_STATE bits		------------------------
.equ	TRAC_STATUS_MASK= 0xE0		;      - Transaction Status (3 bits)
.equ	TRAC_STATUS0	= 5		;          TRAC_STATUS BIT0 position
.equ	TRX_CMD_MASK	= 0x1F		;      - State Control Command (5 bits)
.equ	TRX_CMD0	= 0		;          TRX_CMD BIT0 position
; ::::  TRAC_STATUS	:::: bitfield values
;			0x00		; SUCCESS (RX_AACK, TX_ARET)
;			0x20		; SUCCESS_DATA_PENDING (TX_ARET)
;			0x40		; SUCCESS_WAIT_FOR_ACK (RX_AACK)
;			0x60		; CHANNEL_ACCESS_FAILURE (TX_ARET)
;			0xA0		; NO_ACK (TX_ARET)
;			0xE0		; INVALID (RX_AACK, TX_ARET)
; ::::  TRX_CMD	:::: bitfield values
;			0x00		; NOP
;			0x02		; TX_START
;			0x03		; FORCE_TRX_OFF
;			0x04		; FORCE_PLL_ON
;			0x06		; RX_ON
;			0x08		; TRX_OFF
;			0x09		; PLL_ON (TX_ON)
;			0x16		; RX_AACK_ON
;			0x19		; TX_ARET_ON

; ----------	Register TRX_CTRL_0 bits	------------------------
.equ	Res7		= 7		; 0x80 - Reserved
.equ	PMU_EN		= 6		; 0x40 - Enable Phase Measurement Unit
.equ	PMU_START	= 5		; 0x20 - Start of Phase Measurement Unit
.equ	PMU_IF_INV	= 4		; 0x10 - PMU IF Inverse

